---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.RiserToTreadConnectionOption.RiserBehindTread
enum: Autodesk.Revit.DB.Architecture.RiserToTreadConnectionOption
source: html/871e2085-3752-a39d-db79-d7257c5c1c0b.htm
---
# Autodesk.Revit.DB.Architecture.RiserToTreadConnectionOption.RiserBehindTread

The connection will extend riser behind tread.